import type { Translations } from "./en";

export const ru: Translations = {
    home: {
        title: "Феткары",
        description: {
            main: {
                title: "Общая информация",
                texts: [
                    "Феткары - травоядные вредители, принимают в основу своего облика пищу базового рациона питания. Являются главной проблемой для фермеров, т.к. подъедают посевы. ",
                    "Существа этого вида живут в неглубоких норах и тоннелях, чтобы подъедать корнеплоды.Размножаются почкованием, некоторые подвиды вынашивают детёнышей на себе или через семечки, отрубленные конечности.Меры защиты также отличаются: могут быть ядовитыми, взрываться, выпускать иголки и т.п. ",
                    "Название происходит от слов Manducare(с лат.вкушающие) Fetus(с лат. плоды)."
                ]
            },
            look_and_structure: {
                title: "Внешний вид и строение",
                texts: []
            },
            lifestyle: {
                title: "Образ жизни",
                texts: []
            },
            origins_and_evolution: {
                title: "Происхождение и эволюция",
                texts: []
            },
            classification: {
                title: "Классификация",
                texts: []
            },
            human_interaction: {
                title: "Взаимодействие с человеком",
                texts: []
            },
            fetcars_in_culture: {
                title: "Феткары в культуре",
                texts: []
            }
        }
    },
    world: {
        worldName: "Мир",
        description: "Террадель - это мир, где магия и история переплетаются в невообразимых узорах, словно величественные гобелены, тканые из звёздной пыли и тайных желаний. Каждое приключение в этом мире может стать началом новой легенды, а каждый уголок хранит секреты, ждущие своего открытия, как сокровища, захороненные в глубинах земли."
    },
    fet_dex: {
        title: "Справочник",
        family: {
            vegetable: "Овощ",
            fruit: "Фрукт",
            nut: "Орех",
            berry: "Ягода"
        },
        sub_family: {
            pomegranate: "Гранат",
            peas: "Горох",
            redish: "Редиска",
            onion: "Лук",
            mango: "Манго",
            apple: "Яблоко",
            lemon: "Лимон"
        },
        display: {
            family: "Семейство",
            sub_family: "Подсемейство",
            owner: "Владелец",
        }
    },
    info: {
        loading: "Загрузка ...",
        notFound: 'Страница не найдена',
    },
}